//------------------------------------------------------------------------------
// tree.cpp - содержит функции обработки дерева
//------------------------------------------------------------------------------

#include "tree.h"

//------------------------------------------------------------------------------
// Ввод параметров дерева из потока
void Tree::In(FILE *file) {
    name = new char[20];
    fscanf(file, "%d", &age);
    fscanf(file, "%s", name);
}

// Случайный ввод параметров дерева
void Tree::InRnd() {
    name = new char[20];
    age = Plant::rnd20.Get();
    for (size_t i = 0; i < 20; ++i) {
        name[i] = static_cast<char>('a' + Plant::rnd20.Get());
    }
    name[19] = '\0';
}

//------------------------------------------------------------------------------
// Вывод параметров дерева в поток
void Tree::Out(FILE *file) {
    fprintf(file, "It is tree: age = %ld, name = %s, quotient = %f\n", age, name, Quotient());
}
