//------------------------------------------------------------------------------
// container.cpp - содержит функции обработки контейнера
//------------------------------------------------------------------------------

#include "container.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
void Init(container &c) {
    c.len = 0;
}

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void Clear(container &c) {
    for (int i = 0; i < c.len; ++i) {
        delete c.cont[i];
    }
    c.len = 0;
}

//------------------------------------------------------------------------------
// Ввод содержимого контейнера из указанного потока
void In(container &c, std::ifstream &ifst) {
    while (!ifst.eof()) {
        c.cont[c.len] = In(ifst);
        ++c.len;
    }
}

//------------------------------------------------------------------------------
// Случайный ввод содержимого контейнера
void InRnd(container &c, int size) {
    while (c.len < size) {
        c.cont[c.len] = InRnd();
        ++c.len;
    }
}

//------------------------------------------------------------------------------
// Вывод содержимого контейнера в указанный поток
void Out(container &c, std::ofstream &ofst) {
    ofst << "Container contains " << c.len << " elements.\n";
    for (int i = 0; i < c.len; ++i) {
        ofst << i << ": ";
        Out(*(c.cont[i]), ofst);
    }
}

//------------------------------------------------------------------------------
// Сортировка контейнера по возрастанию с помощью прямого включения
void Sort(container &c) {
    for (int i = 1; i < c.len; ++i) {
        plant *curr_val = c.cont[i];
        int idx = i;
        while ((idx > 0) && (Quotient(*c.cont[idx - 1]) > Quotient(*curr_val))) {
            c.cont[idx] = c.cont[idx - 1];
            --idx;
        }
        c.cont[idx] = curr_val;
    }
}
